from aiogram import types
import textwrap


async def start(message: types.Message):
    await message.answer(
        textwrap.dedent(
            """
                *Вітаю!*👋
                
                Цей бот повідомляє про зміни статусу вашої заявки на _passport.mfa.gov.ua_, щоб почати користуватися ботом надішли свій ідентифікатор.
                Для користування всіма функціями надішліть /cabinet або /help для детальнішої інформації.
                
                Важливо зазначити, що цей бот *НЕ ПОВ'ЯЗАНИЙ* з МЗС України, і не несе відповідальності за вірогідність чи своєчасність інформації, для детального пояснення надішліть /policy
            """
        ),
        parse_mode="Markdown",
    )


async def policy(message: types.Message):
    await message.answer(
        textwrap.dedent(
            """
                *Загальна інформація*
                Бот розроблений для спрощення процесу відстеження статусу заявки на оформлення паспорту на сайті _passport.mfa.gov.ua_ незалежним розробником, і не пов'язаним з МЗС України.
                Використання функцій бота не зобов'язує вас ні до чого, і не несе відповідальності за вірогідність чи своєчасність інформації, використання відбувається на ваш страх та ризик.

                *Користування*
                Функція відотворення статусу заявки доступна лише після надіслання боту вашого ідентифікатора, який ви отримали при реєстрації заявки на сайті _passport.mfa.gov.ua_ ніяким чином не зберігається, і використовується лише для надіслання цьго ідентифікатору на офіційний вебсайт.
                Всі решта функцій доступні (кабінет, сповіщення про зміни статусу) - використовують базу даних та зберігають ваш Telegram ID, Ідентифікатор Сесії _passport.mfa.gov.ua_, та всі статуси заявки.
                Використання цих функцій підтверджує вашу згоду на зберігання цих даних.

                *Як використовується зібрана інформація*
                Ваш Telegram ID використовується для ідентифікації вас в системі, і для надсилання вам сповіщень про зміну статусу заявки, а також привʼязки сесії.
                Ваш ідентифікатор сесії використовується для отримання статусу заявки шляхом запиту на офіційний вебсайт _passport.mfa.gov.ua_.
                Всі статуси заявки зберігаються для відтворення історії змін статусу заявки, та звірення нових статусів з попередніми для виявлення змін.

                *Видалення даних*
                Ви можете видалити всі дані, пов'язані з вашим Telegram ID, надіславши /delete, або зв'язавшись з розробником  @operatorSilence. 

                *Source Code*
                Бот поширюється з відкритим вихідним кодом, ви можете переглянути його за посиланням:
                https://github.com/denver-code/passport-status-bot
                та перевірити все вищезазначене, або ж підняти свій власний бот з власним функціоналом.
            """,
        ),
        parse_mode="Markdown",
    )


async def help(message: types.Message):
    await message.answer(
        textwrap.dedent(
            """
            *Основні:*
            /start - почати роботу з ботом
            /help - допомога
            /policy - політика бота та конфіденційність

            *Персональні Функції:*
            /cabinet - персональний кабінет
            /link <session ID> - прив'язати ідентифікатор
            /unlink або /delete - відв'язати ідентифікатор та видалити профіль
            /update - оновити статус заявки вручну

            *Сповіщення:*
            _Keep in mind: ви можеше мати лише 5 активних підписок_
            /subscribe <session ID> - підписатися на сповіщення
            /unsubscribe <session ID> - відписатися від сповіщень
            /subscriptions - список підписок
            /push - підписатися на сповіщення через NTFY.sh
        """,
        ),
        parse_mode="Markdown",
    )
